00_setEmacs/00_initEmacs/orgEmacs/e31_R.org
* e31_R.org
** R Basic
#+BEGIN_SRC emacs-lisp
  (autoload 'R-mode "ess-site" "Emacs Speaks Statistics mode" t)
  (autoload 'R "ess-site" "start R" t)
  (setq-default inferior-R-program-name "R")  ;; Search R in a nonstandard location on Linux
  (setq-default ess-dialect "R")
  (setq-default inferior-R-args "--no-restore-history --no-save ")
  (setq ess-local-process-name "R")
  (defun ess-set-language ()
    (setq-default ess-language "R")
    (setq ess-language "R")
    )
  (add-hook 'ess-post-run-hook 'ess-set-language t)
#+END_SRC
** DONE R Mode list
#+BEGIN_SRC emacs-lisp
  ;;(setq auto-mode-alist
   ;;     (cons (cons "\\.r$|\\.R$" 'R-mode) auto-mode-alist))

  (add-to-list 'auto-mode-alist '("\\.[rR]$" . R-mode))
  ;; *.r.txt and *.R.txt files activate r-mode            ; Obsolete. Just set TextEdit.app for .R in Finder
  ;; Maybe useful for result files, open with ESS (emacs) or TextEdit.app (GUI) automatically
  (setq auto-mode-alist
        (cons '("\\.r\\.txt$" . R-mode) auto-mode-alist))
  (setq auto-mode-alist
        (cons '("\\.R\\.txt$" . R-mode) auto-mode-alist))
  (setq auto-mode-alist
        (cons '("\\.RRR$" . R-mode) auto-mode-alist))


#+END_SRC
** DONE R Data Summary ess-R-object-popup  R-object-tooltip to show summary
#+BEGIN_SRC emacs-lisp
  (require 'ess-R-object-popup)
  (define-key ess-mode-map (kbd "C-c s") 'ess-R-object-popup)
  ;; the alist
  (setq ess-R-object-popup-alist
        '((numeric    . "summary")
          (factor     . "table")
          (integer    . "summary")
          (lm         . "summary")
          (other      . "str")))
  
#+END_SRC
** DONE R Data view  C-c v, C-c V
#+BEGIN_SRC emacs-lisp
(define-key ess-mode-map (kbd "C-c V") 'ess-R-dv-ctable)
(define-key ess-mode-map (kbd "C-c v") 'ess-R-dv-pprint)
#+END_SRC
** DONE R Auto Complete Source
#+BEGIN_SRC emacs-lisp
      (require 'ac-R)
#+END_SRC
** TODO inlineR
#+BEGIN_SRC emacs-lisp
  ;; (require 'inlineR)
  ;; (setq inlineR-re-funcname "plot\|image\|hogehoge\|my-func")
  ;; (setq inlineR-default-image "png")
  ;; (setq inlineR-default-dir "/tmp/")
  ;; (setq inlineR-cairo-p t)
#+END_SRC
